In [1]:
 pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\kenneth\anaconda3\lib\site-packages (8.3.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector as cn
import pandas as pd
import os

In [3]:
# To create or hid your password, type environment variable, and create the password
password =os.environ.get ("mysqlpassword")

In [4]:
password

'123456789'

In [10]:
# This allows use to connect to a shark_tank database on the local host server of the SQL
try:
    connection= cn.connect(
        user = "root",
        password= password, 
        database= "join1",
        host = "localhost")

    # To enable use to work on the database
    cursor = connection.cursor()

    qryl = "SELECT * FROM departments"
    cursor.execute(qryl)
    result = cursor.fetchall()
    df = pd.DataFrame(result, columns=["DepartmentID", "DepartmentName", "Location"])
    display(df)

except:
    print("check for more detail")

   DepartmentID            DepartmentName       Location
0           101                     Sales       New York
1           102                 Marketing    Los Angeles
2           103                   Finance        Chicago
3           104               Engineering  San Francisco
4           105           Human Resources        Houston
5           106                Operations         Dallas
6           107  Research and Development        Seattle
7           108          Customer Support          Miami
8           109         Quality Assurance         Boston
9           110               IT Services         Denver

   DepartmentID            DepartmentName       Location
0           101                     Sales       New York
1           102                 Marketing    Los Angeles
2           103                   Finance        Chicago
3           104               Engineering  San Francisco
4           105           Human Resources        Houston
5           106                Operations         Dallas
6           107  Research and Development        Seattle
7           108          Customer Support          Miami
8           109         Quality Assurance         Boston
9           110               IT Services         Denver

# To make any change (delete,update) on the table, you must use commit

In [15]:
# This allows use to connect to a shark_tank database on the local host server of the SQL
try:
    connection= cn.connect(
        user = "root",
        password= password, 
        database= "join1",
        host = "localhost")

    # To enable use to work on the database
    cursor = connection.cursor()

    qryl = """
        UPDATE departments
        SET "DepartmentName = "Operations"
        WHERE "DepartmentID = 102;
        """
    
    cursor.execute(qryl)
    connection.commit()

except:
    print("check for more detail")

check for more detail